from collections import OrderedDict

class NotDefinePostFunctionError(KeyError):
    """
    TR의 Post Function을 정의하지 않았을 경우 발생하는 예외
    """
    def __init__(self, rqname, trcode):
        self.msg = "[NotDefinePostFunctionError] Post Function is not defined. (rqname=%s, trcode=%s)" % (rqname, trcode)

    def __str__(self):
        return self.msg


class NotCorrectTypeParamsError(Exception):
    """
    함수 param 전달 시, type이 올바르지 않은 경우 발생하는 예외
    """
    def __init__(self, msg):
        self.msg = "[NotCorrectTypeParamsError] %s" % msg

    def __str__(self):
        return self.msg


class KiwoomProcessingError(Exception):
    """
    Kiwoom open api 동작이 정상이 아닌경우
    """
    def __init__(self, msg):
        self.msg = "[KiwoomProcessingError] %s" % msg

    def __str__(self):
        return self.msg


class KiwoomServerCheckTimeError(Exception):
    """
    Kiwoom open api 서버 점검 시간에 kiwoom module을 사용한 경우
    """
    def __init__(self, error_code):
        self.error_code = error_code
        self.msg = "[KiwoomServerCheckTimeError] ErrorCode: %s" % error_code

    def __str__(self):
        return self.msg


class MarketNameError(Exception):
    """Market 명(kospi, kosdaq)을 잘못 명시한 경우

    """
    def __init__(self, error_code):
        self.error_code = error_code
        self.msg = "[MarketNameError] ErrorCode: %s" % error_code

    def __str__(self):
        return self.msg

# market const
KOSPI="0"
KOSDAQ="10"

class ReturnCode(object):
    """ 키움 OpenApi+ 함수들이 반환하는 값 """
    OP_ERR_NONE = 0  # 정상처리
    OP_ERR_FAIL = -10   # 실패
    OP_ERR_LOGIN = -100  # 사용자정보교환실패
    OP_ERR_CONNECT = -101  # 서버접속실패
    OP_ERR_VERSION = -102   # 버전처리실패
    OP_ERR_FIREWALL = -103  # 개인방화벽실패
    OP_ERR_MEMORY = -104  # 메모리보호실패
    OP_ERR_INPUT = -105  # 함수입력값오류
    OP_ERR_SOCKET_CLOSED = -106  # 통신연결종료
    OP_ERR_SISE_OVERFLOW = -200  # 시세조회과부하
    OP_ERR_RQ_STRUCT_FAIL = -201    # 전문작성초기화실패
    OP_ERR_RQ_STRING_FAIL = -202    # 전문작성입력값오류
    OP_ERR_NO_DATA = -203   # 데이터없음
    OP_ERR_OVER_MAX_DATA = -204  # 조회가능한종목수초과
    OP_ERR_DATA_RCV_FAIL = -205  # 데이터수신실패
    OP_ERR_OVER_MAX_FID = -206  # 조회가능한FID수초과
    OP_ERR_REAL_CANCEL = -207   # 실시간해제오류
    OP_ERR_ORD_WRONG_INPUT = -300   # 입력값오류
    OP_ERR_ORD_WRONG_ACCTNO = -301  # 계좌비밀번호없음
    OP_ERR_OTHER_ACC_USE = -302  # 타인계좌사용오류
    OP_ERR_MIS_2BILL_EXC = -303  # 주문가격이20억원을초과
    OP_ERR_MIS_5BILL_EXC = -304  # 주문가격이50억원을초과
    OP_ERR_MIS_1PER_EXC = -305  # 주문수량이총발행주수의1%초과오류
    OP_ERR_MIS_3PER_EXC = -306  # 주문수량이총발행주수의3%초과오류
    OP_ERR_SEND_FAIL = -307  # 주문전송실패
    OP_ERR_ORD_OVERFLOW = -308  # 주문전송과부하
    OP_ERR_MIS_300CNT_EXC = -309  # 주문수량300계약초과
    OP_ERR_MIS_500CNT_EXC = -310  # 주문수량500계약초과
    OP_ERR_ORD_WRONG_ACCTINFO = -340  # 계좌정보없음
    OP_ERR_ORD_SYMCODE_EMPTY = -500  # 종목코드없음

    CAUSE = {
        0: '정상처리',
        -10: '실패',
        -100: '사용자정보교환실패',
        -102: '버전처리실패',
        -103: '개인방화벽실패',
        -104: '메모리보호실패',
        -105: '함수입력값오류',
        -106: '통신연결종료',
        -200: '시세조회과부하',
        -201: '전문작성초기화실패',
        -202: '전문작성입력값오류',
        -203: '데이터없음',
        -204: '조회가능한종목수초과',
        -205: '데이터수신실패',
        -206: '조회가능한FID수초과',
        -207: '실시간해제오류',
        -300: '입력값오류',
        -301: '계좌비밀번호없음',
        -302: '타인계좌사용오류',
        -303: '주문가격이20억원을초과',
        -304: '주문가격이50억원을초과',
        -305: '주문수량이총발행주수의1%초과오류',
        -306: '주문수량이총발행주수의3%초과오류',
        -307: '주문전송실패',
        -308: '주문전송과부하',
        -309: '주문수량300계약초과',
        -310: '주문수량500계약초과',
        -340: '계좌정보없음',
        -500: '종목코드없음'
    }

class RealType(object):
    REALTYPE = {
        "주식시세": {
            "10": "현재가",
            "11": "전일대비",
            "12": "등락율",
            "27": "(최우선)매도호가",
            "28": "(최우선)매수호가",
            "13": "누적거래량",
            "14": "누적거래대금",
            "16": "시가",
            "17": "고가",
            "18": "저가",
            "25": "전일대비기호",
            "26": "전일거래량대비(계약,주)",
            "29": "거래대금증감",
            "30": "전일거래량대비(비율)",
            "31": "거래회전율",
            "32": "거래비용",
            "311": "시가총액(억)",
            "567": "상한가발생시간",
            "568": "하한가발생시간"
        },
        "주식체결": {
            "20": "체결시간",
            "10": "현재가",
            "11": "전일대비",
            "12": "등락율",
            "27": "(최우선)매도호가",
            "28": "(최우선)매수호가",
            "15": "거래량",
            "13": "누적거래량",
            "14": "누적거래대금",
            "16": "시가",
            "17": "고가",
            "18": "저가",
            "25": "전일대비기호",
            "26": "전일거래량대비(계약,주)",
            "29": "거래대금증감",
            "30": "전일거래량대비(비율)",
            "31": "거래회전율",
            "32": "거래비용",
            "228": "체결강도",
            "311": "시가총액(억)",
            "290": "장구분",
            "691": "KO접근도",
            "567": "상한가발생시간",
            "568": "하한가발생시간"
        },
        "주식우선호가": {
            "27": "(최우선)매도호가",
            "28": "(최우선)매수호가"
        },
        "주식호가잔량": {
            "21": "호가시간",
            "41": "매도호가1",
            "61": "매도호가수량1",
            "81": "매도호가직전대비1",
            "51": "매수호가1",
            "71": "매수호가수량1",
            "91": "매수호가직전대비1",
            "42": "매도호가2",
            "62": "매도호가수량2",
            "82": "매도호가직전대비2",
            "52": "매수호가2",
            "72": "매수호가수량2",
            "92": "매수호가직전대비2",
            "43": "매도호가3",
            "63": "매도호가수량3",
            "83": "매도호가직전대비3",
            "53": "매수호가3",
            "73": "매수호가수량3",
            "93": "매수호가직전대비3",
            "44": "매도호가4",
            "64": "매도호가수량4",
            "84": "매도호가직전대비4",
            "54": "매수호가4",
            "74": "매수호가수량4",
            "94": "매수호가직전대비4",
            "45": "매도호가5",
            "65": "매도호가수량5",
            "85": "매도호가직전대비5",
            "55": "매수호가5",
            "75": "매수호가수량5",
            "95": "매수호가직전대비5",
            "46": "매도호가6",
            "66": "매도호가수량6",
            "86": "매도호가직전대비6",
            "56": "매수호가6",
            "76": "매수호가수량6",
            "96": "매수호가직전대비6",
            "47": "매도호가7",
            "67": "매도호가수량7",
            "87": "매도호가직전대비7",
            "57": "매수호가7",
            "77": "매수호가수량7",
            "97": "매수호가직전대비7",
            "48": "매도호가8",
            "68": "매도호가수량8",
            "88": "매도호가직전대비8",
            "58": "매수호가8",
            "78": "매수호가수량8",
            "98": "매수호가직전대비8",
            "49": "매도호가9",
            "69": "매도호가수량9",
            "89": "매도호가직전대비9",
            "59": "매수호가9",
            "79": "매수호가수량9",
            "99": "매수호가직전대비9",
            "50": "매도호가10",
            "70": "매도호가수량10",
            "90": "매도호가직전대비10",
            "60": "매수호가10",
            "80": "매수호가수량10",
            "100": "매수호가직전대비10",
            "121": "매도호가총잔량",
            "122": "매도호가총잔량직전대비",
            "125": "매수호가총잔량",
            "126": "매수호가총잔량직전대비",
            "23": "예상체결가",
            "24": "예상체결수량",
            "128": "순매수잔량",
            "129": "매수비율",
            "138": "순매도잔량",
            "139": "매도비율",
            "200": "예상체결가전일종가대비",
            "201": "예상체결가전일종가대비등락율",
            "238": "예상체결가전일종가대비기호",
            "291": "예상체결가",
            "292": "예상체결량",
            "293": "예상체결가전일대비기호",
            "294": "예상체결가전일대비",
            "295": "예상체결가전일대비등락율",
            "621": "LP매도호가수량1",
            "631": "LP매수호가수량1",
            "622": "LP매도호가수량2",
            "632": "LP매수호가수량2",
            "623": "LP매도호가수량3",
            "633": "LP매수호가수량3",
            "624": "LP매도호가수량4",
            "634": "LP매수호가수량4",
            "625": "LP매도호가수량5",
            "635": "LP매수호가수량5",
            "626": "LP매도호가수량6",
            "636": "LP매수호가수량6",
            "627": "LP매도호가수량7",
            "637": "LP매수호가수량7",
            "628": "LP매도호가수량8",
            "638": "LP매수호가수량8",
            "629": "LP매도호가수량9",
            "639": "LP매수호가수량9",
            "630": "LP매도호가수량10",
            "640": "LP매수호가수량10",
            "13": "누적거래량",
            "299": "전일거래량대비예상체결률",
            "215": "장운영구분",
            "216": "투자자별ticker"
        },
        "주식시간외호가": {
            "21": "호가시간",
            "131": "시간외매도호가총잔량",
            "132": "시간외매도호가총잔량직전대비",
            "135": "시간외매수호가총잔량",
            "136": "시간외매수호가총잔량직전대비"
        },
        "주식당일거래원": {
            "141": "매도거래원1",
            "161": "매도거래원수량1",
            "166": "매도거래원별증감1",
            "146": "매도거래원코드1",
            "271": "매도거래원색깔1",
            "151": "매수거래원1",
            "171": "매수거래원수량1",
            "176": "매수거래원별증감1",
            "156": "매수거래원코드1",
            "281": "매수거래원색깔1",
            "142": "매도거래원2",
            "162": "매도거래원수량2",
            "167": "매도거래원별증감2",
            "147": "매도거래원코드2",
            "272": "매도거래원색깔2",
            "152": "매수거래원2",
            "172": "매수거래원수량2",
            "177": "매수거래원별증감2",
            "157": "매수거래원코드2",
            "282": "매수거래원색깔2",
            "143": "매도거래원3",
            "163": "매도거래원수량3",
            "168": "매도거래원별증감3",
            "148": "매도거래원코드3",
            "273": "매도거래원색깔3",
            "153": "매수거래원3",
            "173": "매수거래원수량3",
            "178": "매수거래원별증감3",
            "158": "매수거래원코드3",
            "283": "매수거래원색깔3",
            "144": "매도거래원4",
            "164": "매도거래원수량4",
            "169": "매도거래원별증감4",
            "149": "매도거래원코드4",
            "274": "매도거래원색깔4",
            "154": "매수거래원4",
            "174": "매수거래원수량4",
            "179": "매수거래원별증감4",
            "159": "매수거래원코드4",
            "284": "매수거래원색깔4",
            "145": "매도거래원5",
            "165": "매도거래원수량5",
            "170": "매도거래원별증감5",
            "150": "매도거래원코드5",
            "275": "매도거래원색깔5",
            "155": "매수거래원5",
            "175": "매수거래원수량5",
            "180": "매수거래원별증감5",
            "160": "매수거래원코드5",
            "285": "매수거래원색깔5",
            "261": "외국계매도추정합",
            "262": "외국계매도추정합변동",
            "263": "외국계매수추정합",
            "264": "외국계매수추정합변동",
            "267": "외국계순매수추정합",
            "268": "외국계순매수변동",
            "337": "거래소구분"
        },
        "주식예상체결": {
            "20": "체결시간",
            "10": "현재가",
            "11": "전일대비",
            "12": "등락율",
            "15": "거래량",
            "13": "누적거래량",
            "25": "전일대비기호"
        },
        "주식종목정보": {
            "297": "임의연장",
            "592": "장전임의연장",
            "593": "장후임의연장",
            "305": "상한가",
            "306": "하한가",
            "307": "기준가",
            "689": "조기종료ELW발생",
            "594": "통화단위",
            "382": "증거금율표시",
            "370": "종목정보",
            "300": "Extra"
        },
        "주식거래원": {
            "9001": "종목코드,업종코드",
            "9026": "회원사코드(거래원)",
            "302": "종목명",
            "334": "거래원명",
            "20": "체결시간",
            "203": "매도증감",
            "207": "매수증감",
            "210": "순매수수량",
            "211": "순매수수량증감",
            "260": "매매구분Text",
            "337": "거래소구분",
            "10": "현재가",
            "11": "전일대비",
            "12": "등락율",
            "25": "전일대비기호"
        },
        "업종지수": {
            "20": "체결시간",
            "10": "현재가",
            "11": "전일대비",
            "12": "등락율",
            "15": "거래량",
            "13": "누적거래량",
            "14": "누적거래대금",
            "16": "시가",
            "17": "고가",
            "18": "저가",
            "25": "전일대비기호",
            "26": "전일거래량대비(계약,주)"
        },
        "업종등락": {
            "20": "체결시간",
            "252": "상승종목수",
            "251": "상한종목수",
            "253": "보합종목수",
            "255": "하락종목수",
            "254": "하한종목수",
            "13": "누적거래량",
            "14": "누적거래대금",
            "10": "현재가",
            "11": "전일대비",
            "12": "등락율",
            "256": "거래형성종목수",
            "257": "거래형성비율",
            "25": "전일대비기호"
        },
        "장시작시간": {
            "215": "장운영구분",
            "20": "체결시간",
            "214": "장시작예상잔여시간"
        },
        "투자자별매매": {
            "20": "체결시간",
            "217": "이전순매수수량",
            "202": "매도수량",
            "203": "매도증감",
            "204": "매도금액",
            "205": "매도금액증감",
            "206": "매수수량",
            "207": "매수증감",
            "208": "매수금액",
            "209": "매수금액증감",
            "210": "순매수수량",
            "211": "순매수수량증감",
            "212": "순매수금액",
            "213": "순매수금액증감",
            "561": "누적순매수금액",
            "562": "누적순매수수량"
        },
        "주문체결": {
            "9201": "계좌번호",
            "9203": "주문번호",
            "9205": "관리자사번",
            "9001": "종목코드,업종코드",
            "912": "주문업무분류",
            "913": "주문상태",
            "302": "종목명",
            "900": "주문수량",
            "901": "주문가격",
            "902": "미체결수량",
            "903": "체결누계금액",
            "904": "원주문번호",
            "905": "주문구분",
            "906": "매매구분",
            "907": "매도수구분",
            "908": "주문/체결시간",
            "909": "체결번호",
            "910": "체결가",
            "911": "체결량",
            "10": "현재가",
            "27": "(최우선)매도호가",
            "28": "(최우선)매수호가",
            "914": "단위체결가",
            "915": "단위체결량",
            "938": "당일매매수수료",
            "939": "당일매매세금",
            "919": "거부사유",
            "920": "화면번호",
            "921": "터미널번호",
            "922": "신용구분(실시간",
            "923": "대출일(실시간"
        },
        "잔고": {
            "9201": "계좌번호",
            "9001": "종목코드,업종코드",
            "917": "신용구분",
            "916": "대출일",
            "302": "종목명",
            "10": "현재가",
            "930": "보유수량",
            "931": "매입단가",
            "932": "총매입가",
            "933": "주문가능수량",
            "945": "당일순매수량",
            "946": "매도/매수구분",
            "950": "당일총매도손일",
            "951": "예수금",
            "27": "(최우선)매도호가",
            "28": "(최우선)매수호가",
            "307": "기준가",
            "8019": "손익율",
            "957": "신용금액",
            "958": "신용이자",
            "918": "만기일",
            "990": "당일실현손익(유가)",
            "991": "당일실현손익률(유가)",
            "992": "당일실현손익(신용)",
            "993": "당일실현손익률(신용)",
            "959": "담보대출수량",
            "924": "Extra"
        },
        "순간체결량": {
            "20": "체결시간",
            "9001": "종목코드,업종코드",
            "302": "종목명",
            "10": "현재가",
            "25": "전일대비기호",
            "11": "전일대비",
            "12": "등락율",
            "15": "거래량",
            "13": "누적거래량",
            "30": "전일거래량대비(비율)"
        },
        "종목프로그램매매": {
            "20": "체결시간",
            "10": "현재가",
            "25": "전일대비기호",
            "11": "전일대비",
            "12": "등락율",
            "13": "누적거래량",
            "202": "매도수량",
            "204": "매도금액",
            "206": "매수수량",
            "208": "매수금액",
            "210": "순매수수량",
            "212": "순매수금액",
            "213": "순매수금액증감",
            "214": "장시작예상잔여시간",
            "215": "장운영구분",
            "216": "투자자별ticker"
        }
    }

    주식시세 = {
        "10": "현재가",
        "11": "전일대비",
        "12": "등락율",
        "27": "(최우선)매도호가",
        "28": "(최우선)매수호가",
        "13": "누적거래량",
        "14": "누적거래대금",
        "16": "시가",
        "17": "고가",
        "18": "저가",
        "25": "전일대비기호",
        "26": "전일거래량대비(계약,주)",
        "29": "거래대금증감",
        "30": "전일거래량대비(비율)",
        "31": "거래회전율",
        "32": "거래비용",
        "311": "시가총액(억)",
        "567": "상한가발생시간",
        "568": "하한가발생시간"
    }
    주식체결 = {
        "20": "체결시간",
        "10": "현재가",
        "11": "전일대비",
        "12": "등락율",
        "27": "(최우선)매도호가",
        "28": "(최우선)매수호가",
        "15": "거래량",
        "13": "누적거래량",
        "14": "누적거래대금",
        "16": "시가",
        "17": "고가",
        "18": "저가",
        "25": "전일대비기호",
        "26": "전일거래량대비(계약,주)",
        "29": "거래대금증감",
        "30": "전일거래량대비(비율)",
        "31": "거래회전율",
        "32": "거래비용",
        "228": "체결강도",
        "311": "시가총액(억)",
        "290": "장구분",
        "691": "KO접근도",
        "567": "상한가발생시간",
        "568": "하한가발생시간"
    }
    주식우선호가 = {
        "27": "(최우선)매도호가",
        "28": "(최우선)매수호가"
    }
    주식호가잔량 = {
        "21": "호가시간",
        "41": "매도호가1",
        "61": "매도호가수량1",
        "81": "매도호가직전대비1",
        "51": "매수호가1",
        "71": "매수호가수량1",
        "91": "매수호가직전대비1",
        "42": "매도호가2",
        "62": "매도호가수량2",
        "82": "매도호가직전대비2",
        "52": "매수호가2",
        "72": "매수호가수량2",
        "92": "매수호가직전대비2",
        "43": "매도호가3",
        "63": "매도호가수량3",
        "83": "매도호가직전대비3",
        "53": "매수호가3",
        "73": "매수호가수량3",
        "93": "매수호가직전대비3",
        "44": "매도호가4",
        "64": "매도호가수량4",
        "84": "매도호가직전대비4",
        "54": "매수호가4",
        "74": "매수호가수량4",
        "94": "매수호가직전대비4",
        "45": "매도호가5",
        "65": "매도호가수량5",
        "85": "매도호가직전대비5",
        "55": "매수호가5",
        "75": "매수호가수량5",
        "95": "매수호가직전대비5",
        "46": "매도호가6",
        "66": "매도호가수량6",
        "86": "매도호가직전대비6",
        "56": "매수호가6",
        "76": "매수호가수량6",
        "96": "매수호가직전대비6",
        "47": "매도호가7",
        "67": "매도호가수량7",
        "87": "매도호가직전대비7",
        "57": "매수호가7",
        "77": "매수호가수량7",
        "97": "매수호가직전대비7",
        "48": "매도호가8",
        "68": "매도호가수량8",
        "88": "매도호가직전대비8",
        "58": "매수호가8",
        "78": "매수호가수량8",
        "98": "매수호가직전대비8",
        "49": "매도호가9",
        "69": "매도호가수량9",
        "89": "매도호가직전대비9",
        "59": "매수호가9",
        "79": "매수호가수량9",
        "99": "매수호가직전대비9",
        "50": "매도호가10",
        "70": "매도호가수량10",
        "90": "매도호가직전대비10",
        "60": "매수호가10",
        "80": "매수호가수량10",
        "100": "매수호가직전대비10",
        "121": "매도호가총잔량",
        "122": "매도호가총잔량직전대비",
        "125": "매수호가총잔량",
        "126": "매수호가총잔량직전대비",
        "23": "예상체결가",
        "24": "예상체결수량",
        "128": "순매수잔량",
        "129": "매수비율",
        "138": "순매도잔량",
        "139": "매도비율",
        "200": "예상체결가전일종가대비",
        "201": "예상체결가전일종가대비등락율",
        "238": "예상체결가전일종가대비기호",
        "291": "예상체결가",
        "292": "예상체결량",
        "293": "예상체결가전일대비기호",
        "294": "예상체결가전일대비",
        "295": "예상체결가전일대비등락율",
        "621": "LP매도호가수량1",
        "631": "LP매수호가수량1",
        "622": "LP매도호가수량2",
        "632": "LP매수호가수량2",
        "623": "LP매도호가수량3",
        "633": "LP매수호가수량3",
        "624": "LP매도호가수량4",
        "634": "LP매수호가수량4",
        "625": "LP매도호가수량5",
        "635": "LP매수호가수량5",
        "626": "LP매도호가수량6",
        "636": "LP매수호가수량6",
        "627": "LP매도호가수량7",
        "637": "LP매수호가수량7",
        "628": "LP매도호가수량8",
        "638": "LP매수호가수량8",
        "629": "LP매도호가수량9",
        "639": "LP매수호가수량9",
        "630": "LP매도호가수량10",
        "640": "LP매수호가수량10",
        "13": "누적거래량",
        "299": "전일거래량대비예상체결률",
        "215": "장운영구분",
        "216": "투자자별ticker"
    }
    주식시간외호가 = {
        "21": "호가시간",
        "131": "시간외매도호가총잔량",
        "132": "시간외매도호가총잔량직전대비",
        "135": "시간외매수호가총잔량",
        "136": "시간외매수호가총잔량직전대비"
    }
    주식당일거래원 = {
        "141": "매도거래원1",
        "161": "매도거래원수량1",
        "166": "매도거래원별증감1",
        "146": "매도거래원코드1",
        "271": "매도거래원색깔1",
        "151": "매수거래원1",
        "171": "매수거래원수량1",
        "176": "매수거래원별증감1",
        "156": "매수거래원코드1",
        "281": "매수거래원색깔1",
        "142": "매도거래원2",
        "162": "매도거래원수량2",
        "167": "매도거래원별증감2",
        "147": "매도거래원코드2",
        "272": "매도거래원색깔2",
        "152": "매수거래원2",
        "172": "매수거래원수량2",
        "177": "매수거래원별증감2",
        "157": "매수거래원코드2",
        "282": "매수거래원색깔2",
        "143": "매도거래원3",
        "163": "매도거래원수량3",
        "168": "매도거래원별증감3",
        "148": "매도거래원코드3",
        "273": "매도거래원색깔3",
        "153": "매수거래원3",
        "173": "매수거래원수량3",
        "178": "매수거래원별증감3",
        "158": "매수거래원코드3",
        "283": "매수거래원색깔3",
        "144": "매도거래원4",
        "164": "매도거래원수량4",
        "169": "매도거래원별증감4",
        "149": "매도거래원코드4",
        "274": "매도거래원색깔4",
        "154": "매수거래원4",
        "174": "매수거래원수량4",
        "179": "매수거래원별증감4",
        "159": "매수거래원코드4",
        "284": "매수거래원색깔4",
        "145": "매도거래원5",
        "165": "매도거래원수량5",
        "170": "매도거래원별증감5",
        "150": "매도거래원코드5",
        "275": "매도거래원색깔5",
        "155": "매수거래원5",
        "175": "매수거래원수량5",
        "180": "매수거래원별증감5",
        "160": "매수거래원코드5",
        "285": "매수거래원색깔5",
        "261": "외국계매도추정합",
        "262": "외국계매도추정합변동",
        "263": "외국계매수추정합",
        "264": "외국계매수추정합변동",
        "267": "외국계순매수추정합",
        "268": "외국계순매수변동",
        "337": "거래소구분"
    }
    주식예상체결 = {
        "20": "체결시간",
        "10": "현재가",
        "11": "전일대비",
        "12": "등락율",
        "15": "거래량",
        "13": "누적거래량",
        "25": "전일대비기호"
    }
    주식종목정보 = {
        "297": "임의연장",
        "592": "장전임의연장",
        "593": "장후임의연장",
        "305": "상한가",
        "306": "하한가",
        "307": "기준가",
        "689": "조기종료ELW발생",
        "594": "통화단위",
        "382": "증거금율표시",
        "370": "종목정보",
        "300": "Extra"
    }
    주식거래원 = {
        "9001": "종목코드,업종코드",
        "9026": "회원사코드(거래원)",
        "302": "종목명",
        "334": "거래원명",
        "20": "체결시간",
        "203": "매도증감",
        "207": "매수증감",
        "210": "순매수수량",
        "211": "순매수수량증감",
        "260": "매매구분Text",
        "337": "거래소구분",
        "10": "현재가",
        "11": "전일대비",
        "12": "등락율",
        "25": "전일대비기호"
    }
    업종지수 = {
        "20": "체결시간",
        "10": "현재가",
        "11": "전일대비",
        "12": "등락율",
        "15": "거래량",
        "13": "누적거래량",
        "14": "누적거래대금",
        "16": "시가",
        "17": "고가",
        "18": "저가",
        "25": "전일대비기호",
        "26": "전일거래량대비(계약,주)"
    }
    업종등락 = {
        "20": "체결시간",
        "252": "상승종목수",
        "251": "상한종목수",
        "253": "보합종목수",
        "255": "하락종목수",
        "254": "하한종목수",
        "13": "누적거래량",
        "14": "누적거래대금",
        "10": "현재가",
        "11": "전일대비",
        "12": "등락율",
        "256": "거래형성종목수",
        "257": "거래형성비율",
        "25": "전일대비기호"
    }
    장시작시간 = {
        "215": "장운영구분",
        "20": "체결시간",
        "214": "장시작예상잔여시간"
    }
    투자자별매매 = {
        "20": "체결시간",
        "217": "이전순매수수량",
        "202": "매도수량",
        "203": "매도증감",
        "204": "매도금액",
        "205": "매도금액증감",
        "206": "매수수량",
        "207": "매수증감",
        "208": "매수금액",
        "209": "매수금액증감",
        "210": "순매수수량",
        "211": "순매수수량증감",
        "212": "순매수금액",
        "213": "순매수금액증감",
        "561": "누적순매수금액",
        "562": "누적순매수수량"
    }
    주문체결 = {
        "9201": "계좌번호",
        "9203": "주문번호",
        "9205": "관리자사번",
        "9001": "종목코드,업종코드",
        "912": "주문업무분류",
        "913": "주문상태",
        "302": "종목명",
        "900": "주문수량",
        "901": "주문가격",
        "902": "미체결수량",
        "903": "체결누계금액",
        "904": "원주문번호",
        "905": "주문구분",
        "906": "매매구분",
        "907": "매도수구분",
        "908": "주문/체결시간",
        "909": "체결번호",
        "910": "체결가",
        "911": "체결량",
        "10": "현재가",
        "27": "(최우선)매도호가",
        "28": "(최우선)매수호가",
        "914": "단위체결가",
        "915": "단위체결량",
        "938": "당일매매수수료",
        "939": "당일매매세금",
        "919": "거부사유",
        "920": "화면번호",
        "921": "터미널번호",
        "922": "신용구분(실시간",
        "923": "대출일(실시간"
    }
    잔고 = {
        "9201": "계좌번호",
        "9001": "종목코드,업종코드",
        "917": "신용구분",
        "916": "대출일",
        "302": "종목명",
        "10": "현재가",
        "930": "보유수량",
        "931": "매입단가",
        "932": "총매입가",
        "933": "주문가능수량",
        "945": "당일순매수량",
        "946": "매도/매수구분",
        "950": "당일총매도손일",
        "951": "예수금",
        "27": "(최우선)매도호가",
        "28": "(최우선)매수호가",
        "307": "기준가",
        "8019": "손익율",
        "957": "신용금액",
        "958": "신용이자",
        "918": "만기일",
        "990": "당일실현손익(유가)",
        "991": "당일실현손익률(유가)",
        "992": "당일실현손익(신용)",
        "993": "당일실현손익률(신용)",
        "959": "담보대출수량",
        "924": "Extra"
    }
    순간체결량 = {
        "20": "체결시간",
        "9001": "종목코드,업종코드",
        "302": "종목명",
        "10": "현재가",
        "25": "전일대비기호",
        "11": "전일대비",
        "12": "등락율",
        "15": "거래량",
        "13": "누적거래량",
        "30": "전일거래량대비(비율)"
    }
    종목프로그램매매 = {
        "20": "체결시간",
        "10": "현재가",
        "25": "전일대비기호",
        "11": "전일대비",
        "12": "등락율",
        "13": "누적거래량",
        "202": "매도수량",
        "204": "매도금액",
        "206": "매수수량",
        "208": "매수금액",
        "210": "순매수수량",
        "212": "순매수금액",
        "213": "순매수금액증감",
        "214": "장시작예상잔여시간",
        "215": "장운영구분",
        "216": "투자자별ticker"
    }


# 업종코드
class StockCategoryCode(object):
    KOSPI = '001'
    대형주 = '002'
    중형주 = '003'
    소형주 = '004'
    KOSDAQ = '101'
    KOSPI200 = '201'
    KOSTAR = '302'


# 주가변동
class StockPriceFluctuation(object):
    UP = 5  # 상승
    DOWN = 2  # 하락
    STEADINESS = 3  # 보합
